app/controllers/items_controller.rb

SELECT * FROM `items`
---
  def index
    @items = Item.search(params[:search], params[:page])

SELECT * FROM "items" WHERE ("items"."id" = 1)
---
  def show
    @item = Item.find(params[:id])

SELECT * FROM "items" WHERE ("items"."id" = 4)
---
  def edit
    @item = Item.find(params[:id])

INSERT INTO "items" ("updated_at", "title", "mediumimageurl", "type", "author", "detailpageurl", "publicationdate", "asin", "description", "smallimageurl", "created_at") VALUES('2009-05-29 16:57:45', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2009-05-29 16:57:45')
---
  def create
    @item = Item.new(params[:item])
    if @item.save

SELECT * FROM "items" WHERE ("items"."id" = 3)
DELETE FROM "items" WHERE "id" = 3
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy