app/controllers/timeline_items_controller.rb

SELECT * FROM "items" WHERE ("items"."id" = 8)
SELECT * FROM "timelines" WHERE ("timelines"."id" = 1)
---
  def index
    #@timeline_items = TimelineItem.all
    @timeline_items = TimelineItem.find(:all, :include => [ :item, :timeline ], :order => 'items.title')

SELECT * FROM "items" WHERE ("items"."id" = 8)
SELECT * FROM "timeline_items" WHERE ("timeline_items"."id" = 1)
---
  def show
    @timeline_item = TimelineItem.find(params[:id])

SELECT * FROM "timeline_items" WHERE ("timeline_items"."id" = 6)
---
  def edit
    @timeline_item = TimelineItem.find(params[:id])

INSERT INTO "timeline_items" ("item_id", "updated_at", "timeline_id", "position", "created_at") VALUES(8, '2009-05-30 00:24:45', 1, 2008, '2009-05-30 00:24:45')
---
  def create
    @timeline_item = TimelineItem.new(params[:timeline_item])

    if @timeline_item.save

SELECT * FROM "timeline_items" WHERE ("timeline_items"."id" = 18)
UPDATE "timeline_items" SET "position_desc" = '2009', "updated_at" = '2009-06-08 20:46:58' WHERE "id" = 1
---
  def update
    @timeline_item = TimelineItem.find(params[:id])

    if @timeline_item.update_attributes(params[:timeline_item])