app/controllers/timelines_controller.rb

    @timeline_item.item_id = @item.id
    @timeline_item.timeline_id = params[:id]
    @timeline_item.position_desc = 'set'
    @timeline_item.save!
---
INSERT INTO "timeline_items" ("item_id", "updated_at", "timeline_id", "position_desc", "position", "created_at") VALUES(54, '2009-06-08 21:04:05', 1, NULL, 11, '2009-06-08 21:04:05')

  def sort
    params[:dtimeline].each_with_index do |id, index|
      TimelineItem.update_all(['position=?', index+1], ['id=?', id])
---
UPDATE "timeline_items" SET position=1 WHERE (id='23')