app/controllers/timeline_items_controller.rb

  def index
    @timeline_items = TimelineItem.all
---
SELECT * FROM "timeline_items"