app/controllers/timelines_controller.rb

SELECT * FROM "timeline_items" WHERE ("timeline_items".timeline_id = 1) ORDER BY position DESC
SELECT * FROM `timelines`
---
  def index
    @timelines = Timeline.all(:order => 'category, subcategory, genre, featured desc',
                              :include => [ :items, :timeline_items ])

SELECT * FROM "items" WHERE ("items"."id" = 8)
SELECT * FROM "timeline_items" WHERE ("timeline_items".timeline_id = 1) ORDER BY position DESC
SELECT * FROM "timelines" WHERE ("timelines"."id" = 1)
---
  def show
    @timeline = Timeline.find(params[:id], :include => [ :items, :timeline_items ])

SELECT * FROM "timelines" WHERE ("timelines"."id" = 1)
---
  def edit
    @timeline = Timeline.find(params[:id])

INSERT INTO "timelines" ("name", "updated_at", "description", "imageurl", "created_at") VALUES('Pulitzer Prize Winners', '2009-05-29 23:52:21', 'Winners of Fiction Pulizter Prize', '', '2009-05-29 23:52:21')
---
  def create
    @timeline = Timeline.new(params[:timeline])
    if @timeline.save

SELECT * FROM "timelines" WHERE ("timelines"."id" = 1)
UPDATE "timelines" SET "description" = 'Timeline of winners of Pultizer Prize Fiction category', "updated_at" = '2009-05-30 19:06:57' WHERE "id" = 1
---
  def update
    @timeline = Timeline.find(params[:id])
    if @timeline.update_attributes(params[:timeline])